{
  "header": {
    "login": "Login",
    "register": "Registrieren",
    "logout": "Logout",
    "profile": "Profil",
    "navLinks": {
      "home": "Startseite",
      "CV": "Lebenslauf",
      "LinkedIn": "LinkedIn",
      "github": "GitHub",
      "skills": "Fähigkeiten",
      "projects": "Projekte",
      "contact": "Kontakt"
    }
  },
  "contact": {
    "getincontact": "Kontakt aufnehmen",
    "contact": "Kontakt"
  },
  "home": {
    "iAm": "Hallo, ich bin",
    "name": "Yongqi",
    "roles": ["Full-Stack-Entwicklerin", "UI/UX-Designerin"],
    "summary": "Ich entwickle Full-Stack-Webanwendungen und gestalte intuitive Benutzeroberflächen.",
    "myCV": "Mein Lebenslauf",
    "description": "Ich bin eine leidenschaftliche Full-Stack-Entwicklerin, die sich darauf spezialisiert hat, beeindruckende Web-Erlebnisse zu schaffen. Mit Fachkenntnissen in JavaScript, TypeScript und Frameworks wie React, Vue und Nuxt entwickle ich interaktive und benutzerfreundliche Oberflächen. Wenn es um 3D geht, erschaffe ich mit Three.js faszinierende Animationen. Auf der Backend-Seite arbeite ich mit leistungsstarken Technologien wie Node.js, Express.js, SQL und MongoDB."
  },
  "projects": {
    "projects": "Projekte",
    "MyWork": "MEINE ARBEIT",
    "summary": "Diese Projekte zeigen meine Fähigkeiten und Erfahrungen anhand realer Beispiele. Jedes Projekt enthält eine kurze Beschreibung sowie Links zu Code-Repositories und Live-Demos, die meine Problemlösungsfähigkeiten, den Umgang mit verschiedenen Technologien und meine Projektmanagement-Kompetenzen verdeutlichen.",

    "portfolio": "Diese Portfolio-Website wurde mit React und Three.js erstellt und präsentiert meine Fähigkeiten und Erfahrungen in der Webentwicklung.",
    "printmystride": "PrintMyStride ist ein innovativer 3D-Druck-Schuhladen, der maßgeschneiderte Schuhe anbietet. Kunden erhalten nach dem Kauf einen digitalen Fußabdruck, der zur Herstellung personalisierter Schuhe mit modernster 3D-Drucktechnologie genutzt wird. Dieses Projekt ist eine Full-Stack-Anwendung mit einem Express-Backend und einem React-Frontend.",
    "printmystride CMS": "PrintMyStride CMS ist das zentrale Content-Management-System für PrintMyStride. Es ermöglicht das effiziente Management von Produkten, Bestellungen und Kundendaten und sorgt für einen reibungslosen Geschäftsablauf.",
    "3D Map": "Die 3D Interactive Flight Map ist ein Echtzeit-Visualisierungstool für große Displays, das Flugrouten in China darstellt. Nutzer können Flughäfen oder Standorte anklicken, um aktive Flüge in Echtzeit anzuzeigen. Flugrouten werden animiert dargestellt und bieten eine fesselnde Übersicht des Luftverkehrs.",
    "CMS for IT Deutschland Immobilien": "Das CMS für IT Deutschland Immobilien ist eine digitale Plattform zur Verwaltung von Immobilien in Deutschland. Es integriert Daten, Dokumente und Prozesse in ein benutzerfreundliches System und bietet Funktionen wie Property Management, Finanztracking und sicheres Dokumentenmanagement. Die Plattform optimiert Betriebsabläufe, reduziert Kosten und verbessert die Servicequalität.",
    "Canine Cuisine": "Dieses Projekt hebt die Bedeutung von UI/UX-Design hervor, insbesondere die Psychologie hinter Blickrichtungen in Bildern, die Nutzer unbewusst leiten. Visuelle Elemente lenken die Aufmerksamkeit auf wichtige Inhalte. Das Design optimiert die Benutzerinteraktion mit Techniken wie Lazy-Loading von Routen und Bildern sowie Caching für eine reibungslose Navigation.",
    "RhythmWave 3D": "Diese Website ist mein erstes 3D-Webdesign-Projekt mit Three.js und zeigt den wachsenden Trend interaktiver 3D-Websites. Die Plattform kombiniert Klang und visuelle Elemente, indem eine wellenförmige Animation synchron mit Musikrhythmen verläuft. Dieses Projekt demonstriert das Potenzial von 3D im Webdesign und erweitert das Benutzererlebnis um eine interaktive Dimension."
  }
}
